{
  "add_cross_attention": false,
  "architectures": [
    "CamembertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 5,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 6,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "I-VERB_CONCRET",
    "1": "I-VERB_CONTEXTE",
    "2": "B-OBJ",
    "3": "B-SUJ",
    "4": "O",
    "5": "B-VERB_CONTEXTE",
    "6": "E-VERB_CONCRET",
    "7": "B-VERB_CONCRET",
    "8": "E-VERB_CONTEXTE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-OBJ": 2,
    "B-SUJ": 3,
    "B-VERB_CONCRET": 7,
    "B-VERB_CONTEXTE": 5,
    "E-VERB_CONCRET": 6,
    "E-VERB_CONTEXTE": 8,
    "I-VERB_CONCRET": 0,
    "I-VERB_CONTEXTE": 1,
    "O": 4
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "camembert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.3",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 32005
}
